src/cf/DataProcessors/ПодборТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПодборТовара</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/КодыВесовогоТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КодыВесовогоТовара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Качество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Качество</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентВхождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоХарактеристикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджерЗаПокупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияМест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналогВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>____ДополнительноеОписаниеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ПодборТовара/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЭтоГруппаТовара(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.ЭтоГруппа;
КонецФункции

&НаСервере
Функция ЭтоВесовойТовар(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.Весовой;
КонецФункции

&НаСервере
Функция ОбработатьВведенныйШтрихкод(Штрихкод)
	мПрефиксВесовогоТовара=Константы.ПрефиксВесовогоТовара.Получить();
	мДлинаКодаВесовогоТовара=Константы.ДлинаКодаВесовогоТовара.Получить();

	СтруктураВозврата=Новый Структура;
	СтруктураВозврата.Вставить("Номенклатура");
	СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры");
	СтруктураВозврата.Вставить("СерияНоменклатуры");
	СтруктураВозврата.Вставить("Качество");
	СтруктураВозврата.Вставить("ЕдиницаИзмерения");
	СтруктураВозврата.Вставить("Количество");	

	стрТипШК="EAN13";
	МодульМенеджерОборудованияВызовСервера=ОбщегоНазначенияСервер.ОбщийМодуль("МенеджерОборудованияВызовСервера");
	Если НЕ МодульМенеджерОборудованияВызовСервера=Неопределено Тогда
		стрТипШК=МодульМенеджерОборудованияВызовСервера.ОпределитьТипШтрихкода(Штрихкод);
	КонецЕсли;	

	Если ЗначениеЗаполнено(мПрефиксВесовогоТовара) И ЗначениеЗаполнено(мДлинаКодаВесовогоТовара) И стрТипШК="EAN13" Тогда
		 //*** И Лев(Штрихкод, 2) = "2" + мПрефиксВесовогоТовара Тогда
		КодТовара        = Сред(Штрихкод, 3, мДлинаКодаВесовогоТовара);
		КоличествоТовара = Сред(Штрихкод, 3 + мДлинаКодаВесовогоТовара, 10 - мДлинаКодаВесовогоТовара);

		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("КачествоПустаяСсылка", Справочники.Качество.ПустаяСсылка());
		Запрос.УстановитьПараметр("КачествоНовый",        Справочники.Качество.Новый);
		Запрос.УстановитьПараметр("Код",                  Число(КодТовара));
		Запрос.УстановитьПараметр("Коэф", ?(Лев(Штрихкод, 2) = "2" + мПрефиксВесовогоТовара, 1000, 1));
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|    РегКВТ.Номенклатура                         КАК Номенклатура,
		|    РегКВТ.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|    РегКВТ.ХарактеристикаНоменклатуры           КАК ХарактеристикаНоменклатуры,
		|    " + КоличествоТовара + " / &Коэф            КАК Количество,
		|    РегКВТ.СерияНоменклатуры                    КАК СерияНоменклатуры,
		|    ВЫБОР
		|        КОГДА РегКВТ.Качество = &КачествоПустаяСсылка ТОГДА
		|            &КачествоНовый
		|        ИНАЧЕ
		|            РегКВТ.Качество
		|    КОНЕЦ                                       КАК Качество
		|ИЗ
		|    РегистрСведений.КодыВесовогоТовара          КАК РегКВТ
		|ГДЕ
		|    РегКВТ.Код = &Код
		|";
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|    РегШК.Владелец                   КАК Номенклатура,
	|    РегШК.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|    РегШК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|    РегШК.СерияНоменклатуры          КАК СерияНоменклатуры,
	|    РегШК.Качество                   КАК Качество
	|ИЗ
	|    РегистрСведений.Штрихкоды        КАК РегШК
	|ГДЕ
	|    РегШК.Штрихкод = &Штрихкод
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.Номенклатура) = Тип("СправочникСсылка.ИнформационныеКарты") Тогда
		Иначе // Если ТипЗнч(РезультатЗапроса.Владелец) = Тип("СправочникСсылка.Номенклатура")
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;

	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	стрИмя=?(ТипЗнч(Команда)=Тип("Строка"), Команда, Команда.Имя);

	Если стрИмя="НайтиПоШтрихКоду" Тогда
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработкаОповещения_ВвестиШтрихкод", ЭтотОбъект);
		ПоказатьВводСтроки(ОписаниеОповещения, , "Введите штрихкод");

	ИначеЕсли стрИмя="ПоискТовараЗакрыть" Тогда
		ЭтаФорма.Закрыть();
		
	ИначеЕсли стрИмя="Остатки_Обновить" Тогда
		дзОстатки_Сформировать(Элементы.тпНоменклатура.ТекущаяСтрока);

		ЭлементыКоллекции=дзОстатки.ПолучитьЭлементы();
		Для каждого СтрокаКоллекции Из ЭлементыКоллекции Цикл
			Элементы.дзОстатки.Развернуть(СтрокаКоллекции.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
		
	ИначеЕсли стрИмя="Остатки_НастройкаРазворотов" Тогда
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработкаОповещения_НастройкаГруппировок", ЭтотОбъект);
		
		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", "Группировки разворота");
		ПараметрыФормы.Вставить("Пометка", Истина);
		ПараметрыФормы.Вставить("Картинка", Ложь);
		ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
		ПараметрыФормы.Вставить("СписокЗначений", спОстаткиГруппировки.Скопировать());
		
		ОткрытьФорму("ОбщаяФорма.СписокЗначений", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли стрИмя="Остатки_Видимость" Тогда	
		Элементы.ГруппаРасшифровкаОстатков.Видимость=Не Элементы.ГруппаРасшифровкаОстатков.Видимость;		
		
	ИначеЕсли стрИмя="ОткрытьНастройки" Тогда
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_Настройки", ЭтаФорма);

		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("ЗапрашиватьКоличествоВесовогоТовара", ЗапрашиватьКоличествоВесовогоТовара);
		ПараметрыФормы.Вставить("ЗапрашиватьКоличествоОбычногоТовара", ЗапрашиватьКоличествоОбычногоТовара);
		//*** ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
		ПараметрыФормы.Вставить("ПоказыватьЦены", ПоказыватьЦены);
		ПараметрыФормы.Вставить("ПоказыватьОстатки", ПоказыватьОстатки);
		ПараметрыФормы.Вставить("ПоказыватьПотребности", ПоказыватьПотребности);
		ПараметрыФормы.Вставить("ПоказыватьРезервы", ПоказыватьРезервы);

		ОткрытьФорму("Обработка.ПодборТовара.Форма.ФормаНастройки", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	стрГруппировки="";
	Для каждого СтрокаКоллекции Из спОстаткиГруппировки Цикл
		Если НЕ СтрокаКоллекции.Пометка Тогда Продолжить; КонецЕсли;
		стрГруппировки=стрГруппировки+?(ПустаяСтрока(стрГруппировки), "", ",")+СтрокаКоллекции.Значение;
	КонецЦикла;
	Настройки=Новый Структура;
	Настройки.Вставить("ПоказатьРасшифровкуОстатка", Элементы.ГруппаРасшифровкаОстатков.Видимость);
	Настройки.Вставить("ГруппировкиРасшифровкиОстатка", стрГруппировки);
	ХранилищеНастроекДанныхФорм.Сохранить("ПодборТМЦ", "Подбор", Настройки,,ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	Настройки=ХранилищеНастроекДанныхФорм.Загрузить("ПодборТМЦ", "Подбор",,ПараметрыСеанса.ТекущийПользователь);
	Если НЕ ТипЗнч(Настройки)=Тип("Структура") Тогда Возврат; КонецЕсли;
	
	Если Настройки.Свойство("ПоказатьРасшифровкуОстатка") Тогда
		Элементы.ГруппаРасшифровкаОстатков.Видимость=Настройки.ПоказатьРасшифровкуОстатка;
	КонецЕсли;
	
	Если Настройки.Свойство("ГруппировкиРасшифровкиОстатка") Тогда
		стрПредставление=""; НомерСтроки=0;
		МассивСтрок=СтрРазделить(Настройки.ГруппировкиРасшифровкиОстатка, ",");		
		Для каждого Группировки Из МассивСтрок Цикл
			ЭлементСписка=спОстаткиГруппировки.НайтиПоЗначению(Группировки); 
			Если ЭлементСписка=Неопределено Тогда Продолжить; КонецЕсли;
			ЭлементСписка.Пометка=Истина;
			спОстаткиГруппировки.Сдвинуть(ЭлементСписка, -(спОстаткиГруппировки.Индекс(ЭлементСписка)-НомерСтроки));
			стрПредставление=стрПредставление+?(ПустаяСтрока(стрПредставление), "", "\")+ЭлементСписка.Представление;
			НомерСтроки=НомерСтроки+1;
		КонецЦикла;
		Элементы.дзОстаткиПредставление.Заголовок=стрПредставление;
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики оповещения

&НаКлиенте
Процедура ОбработкаОповещения_ВводКоличества(Количество, ПараметрыДоп) Экспорт
	Если Количество=Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыДоп.Вставить("Количество", Количество);
	ПараметрыДоп.Вставить("ПодборТовара", Истина);
	
	ОповеститьОВыборе(ПараметрыДоп);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения_ВвестиШтрихкод(Штрихкод, ПараметрыДоп) Экспорт
	Если ПустаяСтрока(Штрихкод) Тогда Возврат; КонецЕсли;

	СтруктураВозврата=ОбработатьВведенныйШтрихкод(Штрихкод);
	Если ЗначениеЗаполнено(СтруктураВозврата.Номенклатура) Тогда
		СтруктураВозврата.Вставить("ПодборТовара", Истина);
		ОповеститьОВыборе(СтруктураВозврата);
	Иначе
		ПоказатьПредупреждение(,"штрих код не найден!", 10);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения_НастройкаГруппировок(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;
	спОстаткиГруппировки.Очистить();
	стрПредставление="Организация\Склад";
	Если ТипЗнч(Параметр1)=Тип("СписокЗначений") Тогда
		стрПредставление="";
		Для каждого СтрокаКоллекции Из Параметр1 Цикл
			спОстаткиГруппировки.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление, СтрокаКоллекции.Пометка, СтрокаКоллекции.Картинка);
			Если СтрокаКоллекции.Пометка Тогда
				стрПредставление=стрПредставление+?(ПустаяСтрока(стрПредставление), "", "\")+СтрокаКоллекции.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.дзОстаткиПредставление.Заголовок=стрПредставление;

	ВыполнитьДействие(Команды.Остатки_Обновить);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_Настройки(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметр1);
	тпНоменклатура_Инициализация();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Товары"

&НаСервере
Процедура тпНоменклатура_Инициализация()
	стрЗапрос="
	|ВЫБРАТЬ
	|	ИсточникДанных1.Ссылка КАК Ссылка,
	|	ИсточникДанных1.ПометкаУдаления КАК ПометкаУдаления,
	|	ИсточникДанных1.Родитель КАК Родитель,
	|	ИсточникДанных1.ЭтоГруппа КАК ЭтоГруппа,
	|	ИсточникДанных1.Код КАК Код,
	|	ИсточникДанных1.Наименование КАК Наименование,
	|	ИсточникДанных1.Артикул КАК Артикул
	|	,"+?(ПоказыватьЦены, "ИсточникДанных2.Цена", "0")+" КАК Цена
	|	,"+?(ПоказыватьОстатки, "ИсточникДанных3.КоличествоОстаток", "0")+" КАК Остаток
	|	,"+?(ПоказыватьПотребности, "ИсточникДанных4.КоличествоОстаток", "0")+" КАК Потребность
	|	,"+?(ПоказыватьРезервы, "ИсточникДанных5.КоличествоОстаток", "0")+" КАК Резерв
	|ИЗ
	|	Справочник.Номенклатура КАК ИсточникДанных1
	|";
	
	Если ПоказыватьЦены Тогда
		стрЗапрос=стрЗапрос+"
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ТипЦен = &ТипЦены) КАК ИсточникДанных2
		|ПО (ИсточникДанных2.Номенклатура = ИсточникДанных1.Ссылка)
		|";		
	КонецЕсли;

	Если ПоказыватьОстатки Тогда
		стрЗапрос=стрЗапрос+"
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&НаДату) КАК ИсточникДанных3
		|ПО (ИсточникДанных3.Номенклатура = ИсточникДанных1.Ссылка)
		|";
	КонецЕсли;

	Если ПоказыватьПотребности Тогда
		стрЗапрос=стрЗапрос+"
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетПотребностей.Остатки(&НаДату) КАК ИсточникДанных4
		|	ПО (ИсточникДанных4.Номенклатура = ИсточникДанных1.Ссылка)
		|";
	КонецЕсли; 
	
	Если ПоказыватьРезервы Тогда
		стрЗапрос=стрЗапрос+"
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетРезервовТМЦ.Остатки(&НаДату) КАК ИсточникДанных5
		|	ПО (ИсточникДанных5.Номенклатура = ИсточникДанных1.Ссылка)
		|";
	КонецЕсли;
	
	тпНоменклатура.ТекстЗапроса=стрЗапрос;

	ПараметрыДанных=тпНоменклатура.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Если НЕ ПараметрыДанных.Элементы.Найти("НаДату")=Неопределено Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", ТекущаяДата());	
	КонецЕсли;
	Если НЕ ПараметрыДанных.Элементы.Найти("ТипЦены")=Неопределено Тогда
		тпНоменклатура.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦены", ТипЦен);
	КонецЕсли;

	Элементы.тпНоменклатураЦена.Видимость=ПоказыватьЦены;
	Элементы.тпНоменклатураОстаток.Видимость=ПоказыватьОстатки;
	Элементы.тпНоменклатураПотребность.Видимость=ПоказыватьПотребности;
	Элементы.тпНоменклатураРезерв.Видимость=ПоказыватьРезервы;	
КонецПроцедуры
 
&НаКлиенте
Процедура тпНоменклатура_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ЭтоГруппаТовара(ВыбраннаяСтрока) Тогда Возврат; КонецЕсли; 

	ПараметрыДоп=Новый Структура("Номенклатура", ВыбраннаяСтрока);
	
	ЗапрашиватьКоличество=Ложь;
	Если ЗапрашиватьКоличествоВесовогоТовара И ЗапрашиватьКоличествоОбычногоТовара Тогда
		ЗапрашиватьКоличество=Истина;
	ИначеЕсли ЗапрашиватьКоличествоВесовогоТовара И ЭтоВесовойТовар(ВыбраннаяСтрока) Тогда
		ЗапрашиватьКоличество=Истина;
	ИначеЕсли ЗапрашиватьКоличествоОбычногоТовара И НЕ ЭтоВесовойТовар(ВыбраннаяСтрока) Тогда
		ЗапрашиватьКоличество=Истина;
	КонецЕсли;
	
	Если ЗапрашиватьКоличество Тогда
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработкаОповещения_ВводКоличества", ЭтотОбъект, ПараметрыДоп);
		ВведенноеЗначение=1; ПоказатьВводЧисла(ОписаниеОповещения, ВведенноеЗначение, "Введите количество", 15, 3);	
	Иначе
		ОбработкаОповещения_ВводКоличества(1, Новый Структура("Номенклатура", ВыбраннаяСтрока));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тпНоменклатура_ПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("дзОстатки_Обновить", 0.1, Истина);	
	Если Не Элементы.тпНоменклатура.ТекущаяСтрока=Неопределено Тогда
		КартинкаТовара=ПолучитьНавигационнуюСсылку(Элементы.тпНоменклатура.ТекущаяСтрока, "ОсновноеИзображение");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура тпНоменклатура_УстановитьЗначенияОтбораПользовательскойНастройки()
	Если НЕ ТипЗнч(СтруктураОтбораПользовательскихНастроек)=Тип("Структура") Тогда Возврат; КонецЕсли; 

    Для Каждого ЭлементНастройки Из тпНоменклатура.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки)=Тип("ОтборКомпоновкиДанных") Тогда
			Для каждого СтрокаКоллекции Из СтруктураОтбораПользовательскихНастроек Цикл
				ЭлементНайден=Ложь;
				ПолеОтбора=Новый ПолеКомпоновкиДанных(СтрокаКоллекции.Ключ);
				Для каждого ЭлементОтбора Из ЭлементНастройки.Элементы Цикл
					Если ЭлементОтбора.ЛевоеЗначение=ПолеОтбора Тогда
						ЭлементОтбора.ПравоеЗначение=СтрокаКоллекции.Значение;
						ЭлементНайден=Истина; Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не ЭлементНайден Тогда
					ЭлементОтбора=ЭлементНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение=ПолеОтбора;
					ЭлементОтбора.ПравоеЗначение=СтрокаКоллекции.Значение;
					ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.Использование=Истина;
					ЭлементОтбора.ПредставлениеПользовательскойНастройки=СокрЛП(ПолеОтбора);
					ЭлементОтбора.ИдентификаторПользовательскойНастройки=СтрокаКоллекции.Ключ;
				КонецЕсли;
			КонецЦикла;
			Прервать;
        КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Остатки"

&НаСервере
Процедура дзОстатки_Сформировать(Номенклатура)
	дзДанные=Новый ДеревоЗначений;
	дзОстатки.ПолучитьЭлементы().Очистить();

	СхемаКомпоновкиДанных=Обработки.ПодборТовара.ПолучитьМакет("РасшифровкаОстатков");

	МассивГруппировок=Новый Массив;
	Для каждого СтрокаКоллекции Из спОстаткиГруппировки Цикл
		Если НЕ СтрокаКоллекции.Пометка Тогда Продолжить; КонецЕсли; 
		МассивГруппировок.Добавить(СтрокаКоллекции.Значение);
	КонецЦикла;

	Если НЕ МассивГруппировок.Количество()=0 Тогда
		КомпоновщикНастроек.Настройки.Структура.Очистить();
		
		ЭлементСтруктуры=КомпоновщикНастроек.Настройки;
		Для каждого СтрокаКоллекции Из МассивГруппировок Цикл
			ЭлементСтруктуры=ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			ЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

			ПолеГруппировки=ЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование=Истина;
			ПолеГруппировки.Поле=Новый ПолеКомпоновкиДанных(СтрокаКоллекции);			
		КонецЦикла; 
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);

	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(дзДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Если дзДанные.Строки.Количество()=0 Тогда Возврат; КонецЕсли;
	
	дзОстатки_Заполнить(дзДанные.Строки, дзОстатки.ПолучитьЭлементы(), МассивГруппировок, 0);
	
	МассивСтрок=дзОстатки.ПолучитьЭлементы();
	Если МассивСтрок.Количество()=1 Тогда Возврат; КонецЕсли;
	МассивСтрок[МассивСтрок.Количество()-1].Представление="Итого:";
КонецПроцедуры

&НаКлиенте
Процедура дзОстатки_Обновить()
	ОтключитьОбработчикОжидания("дзОстатки_Обновить");
	дзОстатки_Сформировать(Элементы.тпНоменклатура.ТекущаяСтрока);

	//Развернуть все уровни дерева
	МассивСтрок=дзОстатки.ПолучитьЭлементы();
	Для каждого СтрокаКоллекции Из МассивСтрок Цикл
		Элементы.дзОстатки.Развернуть(СтрокаКоллекции.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
КонецПроцедуры
 
&НаСервере
Процедура дзОстатки_Заполнить(Источник, Приемник, МассивГруппировок, ИндексМассиваИзмерений)
	Для каждого СтрокаКоллекции Из Источник Цикл
		НоваяСтрока=Приемник.Добавить();
		НоваяСтрока.Представление=СтрокаКоллекции[МассивГруппировок[ИндексМассиваИзмерений]];
		НоваяСтрока.Количество=СтрокаКоллекции.Количество;

		дзОстатки_Заполнить(СтрокаКоллекции.Строки, Приемник[Источник.Индекс(СтрокаКоллекции)].ПолучитьЭлементы(), МассивГруппировок, ИндексМассиваИзмерений+1);		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура дзОстатки_Инициализация()
	СхемаКомпоновкиДанных=Обработки.ПодборТовара.ПолучитьМакет("РасшифровкаОстатков");
	URLСхемы=ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());

	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	спОстаткиГруппировки.Добавить("Организация", "Организация", Истина);
	спОстаткиГруппировки.Добавить("Склад", "Склад", Истина);
	Если Константы.ИспользоватьХарактеристикиНоменклатуры.Получить() Тогда
		спОстаткиГруппировки.Добавить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры", Ложь);
	КонецЕсли; 
	Если Константы.ИспользоватьСерииНоменклатуры.Получить() Тогда
		спОстаткиГруппировки.Добавить("СерияНоменклатуры", "Серия номенклатуры", Ложь);
	КонецЕсли; 
	спОстаткиГруппировки.Добавить("Качество", "Качество");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ЗапрашиватьКоличествоВесовогоТовара", ЗапрашиватьКоличествоВесовогоТовара);
	Параметры.Свойство("ЗапрашиватьКоличествоОбычногоТовара", ЗапрашиватьКоличествоОбычногоТовара);
	Параметры.Свойство("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
	Параметры.Свойство("Склад", Склад);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ТипЦен", ТипЦен);	
	Параметры.Свойство("ПоказыватьЦены", ПоказыватьЦены);
	Параметры.Свойство("ПоказыватьОстатки", ПоказыватьОстатки);
	Параметры.Свойство("ПоказыватьПотребности", ПоказыватьПотребности);
	Параметры.Свойство("ПоказыватьРезервы", ПоказыватьРезервы);

	ЗагрузитьНастройки();

	СтруктураОтбораПользовательскихНастроек=Новый Структура;
	СтруктураОтбораПользовательскихНастроек.Вставить("Склад", Склад);
	СтруктураОтбораПользовательскихНастроек.Вставить("Организация", Организация);

	тпНоменклатура_Инициализация();
		
	дзОстатки_Инициализация();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЗакрыватьПриЗакрытииВладельца=Истина;
	тпНоменклатура_УстановитьЗначенияОтбораПользовательскойНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли; 
КонецПроцедуры
